---
kind: method
id: M:Autodesk.Revit.DB.Visual.AssetPropertyFloatArray.GetValue
source: html/ce0fb41c-bd03-29bc-1fc5-e731a3b0da4a.htm
---
# Autodesk.Revit.DB.Visual.AssetPropertyFloatArray.GetValue Method

Get the value of the property.

## Syntax (C#)
```csharp
public IList<float> GetValue()
```